In [1]:
import pandas as pd

# Exerc√≠cios 01

# üéØ Parte 1 ‚Äî Series e DataFrames

## 1. 
Crie uma Series com os valores [100, 200, 300, 400, 500] e √≠ndices nomeados como: ['A', 'B', 'C', 'D', 'E'].

Acesse o valor do √≠ndice 'C'.

Verifique se o valor 400 est√° na Series.

In [27]:
df = pd.DataFrame(index=['A', 'B', 'C', 'D', 'E'], data={'valores': [100, 200, 300, 400, 500]})

In [28]:
df

   valores
A      100
B      200
C      300
D      400
E      500

In [31]:
df.loc['C'] # Acessando o valor do √≠ndice 'C'

valores    300
Name: C, dtype: int64

In [39]:
# df.iloc[0:4] == 400

# Verificando se o valor '400' est√° presente na Series 'valores'
df[df['valores'] == 400]

   valores
D      400

## 2.
Crie um dataFrame com os dados abaixo:

| Produto  | Pre√ßo | Quantidade |
| -------- | ----- | ---------- |
| Arroz    | 20    | 2          |
| Feij√£o   | 8     | 4          |
| Macarr√£o | 5     | 3          |
| Leite    | 4     | 6          |


- Calcule a coluna `"Total"` (Pre√ßo * Quantidade).
- Exiba apenas a coluna Produto usando `.iloc[]`.
- Exiba as 2 primeiras linhas usando `.iloc[]`.

In [41]:
dados2 = {
    'produto':['Arroz', 'Feij√£o', 'Macarr√£o', 'Leite'],
    'preco':[20, 8, 5, 4],
    'quantidade':[2, 4, 3, 6]
}

df2 = pd.DataFrame(dados2)

In [42]:
df2

    produto  preco  quantidade
0     Arroz     20           2
1    Feij√£o      8           4
2  Macarr√£o      5           3
3     Leite      4           6

In [43]:
# Criando a coluna 'Total' no dataframe e calculando
df2['Total'] = df2['preco'] * df2['quantidade']

In [44]:
df2

    produto  preco  quantidade  Total
0     Arroz     20           2     40
1    Feij√£o      8           4     32
2  Macarr√£o      5           3     15
3     Leite      4           6     24

In [47]:
# Exiba apenas a coluna Produto usando .iloc[].
df2.iloc[:, 0]

0       Arroz
1      Feij√£o
2    Macarr√£o
3       Leite
Name: produto, dtype: object

In [49]:
# Exiba as 2 primeiras linhas usando .iloc[].
df2.iloc[0:2]

  produto  preco  quantidade  Total
0   Arroz     20           2     40
1  Feij√£o      8           4     32

___

# üéØ Parte 2 ‚Äî Filtros e Indexa√ß√£o

## 3.
Filtre o DataFrame acima para:
- Mostrar os produtos com Pre√ßo maior que 5.
- Mostrar os produtos com Quantidade menor ou igual a 3.
- Mostrar produtos cujo nome seja 'Feij√£o' ou 'Leite'.

In [51]:
df2 # Ser√° o DataFrame utilizado nesse exercicio

    produto  preco  quantidade  Total
0     Arroz     20           2     40
1    Feij√£o      8           4     32
2  Macarr√£o      5           3     15
3     Leite      4           6     24

In [52]:
# Mostrar os produtos com Pre√ßo maior que 5.
df2[df2['preco'] > 5]

  produto  preco  quantidade  Total
0   Arroz     20           2     40
1  Feij√£o      8           4     32

In [53]:
# Mostrar os produtos com Quantidade menor ou igual a 3.
df2[df2['quantidade'] <= 3]

    produto  preco  quantidade  Total
0     Arroz     20           2     40
2  Macarr√£o      5           3     15

In [58]:
# Mostrar produtos cujo nome seja 'Feij√£o' ou 'Leite'.
df2[(df2['produto'] == 'Feij√£o') | (df2['produto'] == 'Leite')]

  produto  preco  quantidade  Total
1  Feij√£o      8           4     32
3   Leite      4           6     24

In [62]:
# Mostrar produtos cujo nome seja 'Feij√£o' ou 'Leite'.
# Mostrando de outra maneira para ser resolvido:
df2[df2['produto'].isin(['Feij√£o', 'Leite'])]

  produto  preco  quantidade  Total
1  Feij√£o      8           4     32
3   Leite      4           6     24

## 4
Defina a coluna 'Produto' como √≠ndice do DataFrame.
- Filtre apenas os dados do produto 'Arroz'.

In [60]:
df2

    produto  preco  quantidade  Total
0     Arroz     20           2     40
1    Feij√£o      8           4     32
2  Macarr√£o      5           3     15
3     Leite      4           6     24

In [64]:
df2.set_index('produto', inplace=True)

In [65]:
df2

          preco  quantidade  Total
produto
Arroz        20           2     40
Feij√£o        8           4     32
Macarr√£o      5           3     15
Leite         4           6     24

In [67]:
# Filtre apenas os dados do produto 'Arroz'.
df2.iloc[0]

preco         20
quantidade     2
Total         40
Name: Arroz, dtype: int64

___

# üéØ Parte 3 ‚Äî Dados Ausentes

## 5.
Crie um novo DataFrame com dados faltantes:

| Nome  | Idade | Cidade         |
| ----- | ----- | -------------- |
| Ana   | 25    | S√£o Paulo      |
| Bruno | NaN   | Rio de Janeiro |
| Carla | 30    | NaN            |


- Verifique onde existem dados ausentes.
- Preencha as idades ausentes com a m√©dia das idades.
- Preencha as cidades ausentes com `"N√£o informado"`.

In [68]:
import numpy as np

dados3 = {
    'Nome':['Ana', 'Bruno', 'Carla'],
    'Idade':[25, np.nan, 30],
    'Cidade':['S√£o Paulo', 'Rio de Janeiro', np.nan]
}

df3 = pd.DataFrame(dados3)

In [69]:
df3

    Nome  Idade          Cidade
0    Ana   25.0       S√£o Paulo
1  Bruno    NaN  Rio de Janeiro
2  Carla   30.0             NaN

In [71]:
# Verifique onde existem dados ausentes.
df3.isnull() # -> Vai mostrar True onde estiver ausente!

    Nome  Idade  Cidade
0  False  False   False
1  False   True   False
2  False  False    True

In [74]:
# Preencha as idades ausentes com a m√©dia das idades.
df3['Idade'] = df3['Idade'].fillna(df3['Idade'].mean())

# Preencha as cidades ausentes com "N√£o informado".
df3['Cidade'] = df3['Cidade'].fillna('N√£o Informado')

In [75]:
df3

    Nome  Idade          Cidade
0    Ana   25.0       S√£o Paulo
1  Bruno   27.5  Rio de Janeiro
2  Carla   30.0   N√£o Informado

___

# üéØ Parte 4 ‚Äî Opera√ß√µes com DataFrames


## 6. 
No DataFrame dos produtos:
- Aplique um desconto de 10% no pre√ßo e salve em uma nova coluna 'Pre√ßo_com_Desconto'.
- Calcule o pre√ßo m√©dio dos produtos.
- Crie uma coluna booleana 'Caro' que indique se o produto custa mais que R$10.

In [76]:
df2 # Ser√° utilizado esse DataFrame para esse exerc√≠cio

          preco  quantidade  Total
produto
Arroz        20           2     40
Feij√£o        8           4     32
Macarr√£o      5           3     15
Leite         4           6     24

In [77]:
# Aplique um desconto de 10% no pre√ßo e salve em uma nova coluna 'Pre√ßo_com_Desconto'.
desconto = df2['preco'] / 10 # Para calcular 10% de desconto em um produto, voc√™ pode dividir o pre√ßo original do produto por 10.
df2['Preco_Com_Desconto'] = df2['preco'] - desconto

In [78]:
df2

          preco  quantidade  Total  Preco_Com_Desconto
produto
Arroz        20           2     40                18.0
Feij√£o        8           4     32                 7.2
Macarr√£o      5           3     15                 4.5
Leite         4           6     24                 3.6

In [80]:
# Calcule o pre√ßo m√©dio dos produtos.
df2['preco'].mean() # Resultado: 9.25

np.float64(9.25)

In [88]:
# Crie uma coluna booleana 'Caro' que indique se o produto custa mais que R$10
df2['Caro'] = [True if x > 10 else False for x in df2['preco'] ]

In [89]:
df2

          preco  quantidade  Total  Preco_Com_Desconto   Caro
produto
Arroz        20           2     40                18.0   True
Feij√£o        8           4     32                 7.2  False
Macarr√£o      5           3     15                 4.5  False
Leite         4           6     24                 3.6  False

___

# üéØ Parte 5 ‚Äî Agrupamento com GroupBy

## 7. 
Crie um novo dataFrame:

| Categoria | Produto      | Vendas |
| --------- | ------------ | ------ |
| Alimento  | Arroz        | 200    |
| Alimento  | Feij√£o       | 150    |
| Bebida    | Suco         | 180    |
| Bebida    | Refrigerante | 120    |


- Agrupe por 'Categoria' e calcule a soma de 'Vendas'.
- Mostre a quantidade de produtos em cada categoria.

In [90]:
dados4 = {
    'Categoria': ['Alimento', 'Alimento', 'Bebida', 'Bebida'],
    'Produto': ['Arroz', 'Feij√£o', 'Suco', 'Refrigerante'],
    'Vendas': [200, 150, 180, 120]
}

df4 = pd.DataFrame(dados4)

In [91]:
df4

  Categoria       Produto  Vendas
0  Alimento         Arroz     200
1  Alimento        Feij√£o     150
2    Bebida          Suco     180
3    Bebida  Refrigerante     120

In [92]:
# Agrupe por 'Categoria' e calcule a soma de 'Vendas'.
df4.groupby('Categoria')['Vendas'].sum()

Categoria
Alimento    350
Bebida      300
Name: Vendas, dtype: int64

In [94]:
# Mostre a quantidade de produtos em cada categoria.
df4.groupby('Categoria')['Produto'].count()

Categoria
Alimento    2
Bebida      2
Name: Produto, dtype: int64

___

# üéØ Parte 6 ‚Äî Merge, Join e Concat

## 8.
Crie dois dataFrames:

In [96]:
clientes = pd.DataFrame({
    'ID': [1, 2, 3],
    'Nome': ['Ana', 'Bruno', 'Carla']
})

compras = pd.DataFrame({
    'ID': [2, 3, 4],
    'Produto': ['Arroz', 'Feij√£o', 'Leite']
})

df_clientes = pd.DataFrame(clientes)
df_compras = pd.DataFrame(compras)

In [97]:
df_clientes

   ID   Nome
0   1    Ana
1   2  Bruno
2   3  Carla

In [98]:
df_compras

   ID Produto
0   2   Arroz
1   3  Feij√£o
2   4   Leite

- Fa√ßa um merge usando o ID (inner join).
- Fa√ßa um merge do tipo outer.
- Fa√ßa um concat vertical desses dois DataFrames (ignorar o ID).

In [106]:
# Fa√ßa um merge usando o ID (igual ao inner join do SQL).
pd.merge(df_clientes, df_compras, on='ID')

   ID   Nome Produto
0   2  Bruno   Arroz
1   3  Carla  Feij√£o

In [105]:
# Fa√ßa um merge do tipo outer.
pd.merge(df_clientes, df_compras, how="outer")

   ID   Nome Produto
0   1    Ana     NaN
1   2  Bruno   Arroz
2   3  Carla  Feij√£o
3   4    NaN   Leite

In [104]:
# Fa√ßa um concat vertical desses dois DataFrames (ignorar o ID).
pd.concat([df_clientes, df_compras])

   ID   Nome Produto
0   1    Ana     NaN
1   2  Bruno     NaN
2   3  Carla     NaN
0   2    NaN   Arroz
1   3    NaN  Feij√£o
2   4    NaN   Leite

___

# Parte 7 ‚Äî S√©ries Temporais

## 9. 
Crie uma sequ√™ncia de datas di√°rias de '2024-01-01' a '2024-01-10':

- Crie um DataFrame com essa data e uma coluna aleat√≥ria chamada 'Vendas'.
- Defina a coluna de datas como √≠ndice.
- Filtre as vendas dos dias '2024-01-03' at√© '2024-01-07'.
- Reamostre os dados para frequ√™ncia semanal somando as vendas.

In [111]:
# Crie uma sequ√™ncia de datas di√°rias de '2024-01-01' a '2024-01-10':
datas = pd.date_range(start='2024-01-01', periods=10, freq='D')

# Crie um DataFrame com essa data e uma coluna aleat√≥ria chamada 'Vendas'.
vendas = [125, 136, 80, 92, 101, 101, 242, 96, 20, 120]

df5 = pd.DataFrame({'Data': datas, 'Vendas': vendas})

In [112]:
df5

        Data  Vendas
0 2024-01-01     125
1 2024-01-02     136
2 2024-01-03      80
3 2024-01-04      92
4 2024-01-05     101
5 2024-01-06     101
6 2024-01-07     242
7 2024-01-08      96
8 2024-01-09      20
9 2024-01-10     120

In [113]:
df5.set_index('Data', inplace=True)

In [119]:
df5.index

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05', '2024-01-06', '2024-01-07', '2024-01-08',
               '2024-01-09', '2024-01-10'],
              dtype='datetime64[ns]', name='Data', freq=None)

In [114]:
df5

            Vendas
Data
2024-01-01     125
2024-01-02     136
2024-01-03      80
2024-01-04      92
2024-01-05     101
2024-01-06     101
2024-01-07     242
2024-01-08      96
2024-01-09      20
2024-01-10     120

In [117]:
# Filtre as vendas dos dias '2024-01-03' at√© '2024-01-07'.
df5.loc['2024-01-03':'2024-01-07']

            Vendas
Data
2024-01-03      80
2024-01-04      92
2024-01-05     101
2024-01-06     101
2024-01-07     242

In [122]:
# Reamostre os dados para frequ√™ncia semanal somando as vendas.
df5.resample('W').sum()

            Vendas
Data
2024-01-07     877
2024-01-14     236

___

# Parte 8 ‚Äî Entrada e Sa√≠da de Dados

## 10.
(Opcional) Salve qualquer DataFrame criado em:
- Um arquivo CSV (.to_csv()).
- Um arquivo Excel (.to_excel()).

Depois tente ler novamente o arquivo salvo.